In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd

In [3]:
#import pandas testing utility
import pandas.util.testing as tm; tm.N = 3

#Create an unpivoted function
def unpivot(frame):
    N, K = frame.shape
    
    data = {'value' : frame.values.ravel('F'),
            'variable' : np.asarray(frame.columns).repeat(N),
            'date' : np.tile(np.asarray(frame.index), K)}
    
    # Return the DataFrame
    return DataFrame(data, columns=['date', 'variable', 'value'])

#Set the DataFrame we'll be using
dframe = unpivot(tm.makeTimeDataFrame())

In [4]:
dframe

         date variable     value
0  2000-01-03        A -0.285232
1  2000-01-04        A -0.109688
2  2000-01-05        A  1.573638
3  2000-01-03        B -0.567965
4  2000-01-04        B -0.438125
5  2000-01-05        B  0.650319
6  2000-01-03        C  0.179432
7  2000-01-04        C -0.583193
8  2000-01-05        C  3.036396
9  2000-01-03        D  1.011693
10 2000-01-04        D -0.639373
11 2000-01-05        D -1.895605

In [6]:
dframe_piv = dframe.pivot('date','variable','value')
dframe_piv

variable           A         B         C         D
date
2000-01-03 -0.285232 -0.567965  0.179432  1.011693
2000-01-04 -0.109688 -0.438125 -0.583193 -0.639373
2000-01-05  1.573638  0.650319  3.036396 -1.895605

In [ ]:
"""Duplicates in DataFrames"""

In [7]:
dframe = DataFrame({'key1':['A']*2 + ['B']*3,
                    'key2' : [2,2,2,3,3]})
dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [8]:
dframe.duplicated() #tell which row is a duplicate

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [10]:
dframe.drop_duplicates()

  key1  key2
0    A     2
2    B     2
3    B     3

In [12]:
dframe.drop_duplicates(['key1']) #drops duplicates only from key1 column

  key1  key2
0    A     2
2    B     2

In [13]:
dframe

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [18]:
dframe.drop_duplicates(['key1'],keep='last')

  key1  key2
1    A     2
4    B     3